# DelClass

## Description
Deletes the specified class from the active document. If there are objects in the class to be deleted, they are reassigned to the None class. &lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE DelClass(className : STRING);
```

```python

def vs.DelClass(className):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class to delete.|

## Examples
```pascal
DelClass('Future Construction');

```

## Version
Availability: from MiniCAD
## Category
* Classes